In [5]:
import pandas as pd 
pd.__version__

'2.2.0'

# Sample 1 Data Frame

In [12]:
df = pd.DataFrame({'A Col': [1, 2, 3,4], 'B Col': [4, 5, 6,4]}) #same length arrays made in this data frame
# print(df)
df.head()

   A Col  B Col
0      1      4
1      2      5
2      3      6
3      4      4

In [1]:
import pandas as pd

df = pd.DataFrame({
    'A Col': [1, 2, 3, 5, 6],
    'B Col': [4, 5, 6, 4, 5]  # Corrected the number of elements
})

#print(df)

df

C:\Users\BUCKY\AppData\Local\Temp\ipykernel_1020\1142709408.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

   A Col  B Col
0      1      4
1      2      5
2      3      6
3      5      4
4      6      5

In [2]:
import pandas as pd
df = pd.DataFrame({'A Col': [1,2,3,5,6], "B Col" : [4,5,6,4,5]})
#print(df)

df

   A Col  B Col
0      1      4
1      2      5
2      3      6
3      5      4
4      6      5

# Sample 2 Data Frame

In [30]:
import pandas as pd

# Create a sample DataFrame
df = pd.DataFrame({
    'Name' : ["Faizan","Ali","Shayan","Hamza","Raza","Warris","Saad","Arham","Jawad"],
    'Age' : [24,56,24,11,45,21,22,14,56],
    'Grade' :["A+","B-","F","D+","C-","C+","B-","A","A-"]
})
#print(df)
df

     Name  Age Grade
0  Faizan   24    A+
1     Ali   56    B-
2  Shayan   24     F
3   Hamza   11    D+
4    Raza   45    C-
5  Warris   21    C+
6    Saad   22    B-
7   Arham   14     A
8   Jawad   56    A-

In [69]:
df.info() #before type casting

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    9 non-null      object
 1   Age     9 non-null      float64
 2   Grade   9 non-null      category
dtypes: category(1), float64(1), object(1)
memory usage: 649.0+ bytes

## Type Casting Of Data Sets:

In [70]:
import pandas as pd

# Create a sample DataFrame
df = pd.DataFrame({
    'Name' : ["Faizan","Ali","Shayan","Hamza","Raza","Warris","Saad","Arham","Jawad"],
    'Age' : [24,56,24,11,45,21,22,14,56],
    'Grade' :["A+","B-","F","D+","C-","C+","B-","A","A-"]
})

# Change the data type of the 'Name' column to int
df['Name'] = df['Name'].astype("object")

# Change the data type of the 'Age' column to float
df['Age'] = df['Age'].astype(float)

# Change the data type of the 'Grade' column to Category
df['Grade'] = df['Grade'].astype('category')

# Print the updated DataFrame
#print(df)
df

     Name   Age Grade
0  Faizan  24.0    A+
1     Ali  56.0    B-
2  Shayan  24.0     F
3   Hamza  11.0    D+
4    Raza  45.0    C-
5  Warris  21.0    C+
6    Saad  22.0    B-
7   Arham  14.0     A
8   Jawad  56.0    A-

## Data Frames Funtions

In [71]:
df.head()

     Name   Age Grade
0  Faizan  24.0    A+
1     Ali  56.0    B-
2  Shayan  24.0     F
3   Hamza  11.0    D+
4    Raza  45.0    C-

In [32]:
df.tail()

     Name  Age Grade
4    Raza   45    C-
5  Warris   21    C+
6    Saad   22    B-
7   Arham   14     A
8   Jawad   56    A-

In [72]:
df.info() #before type casting

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    9 non-null      object
 1   Age     9 non-null      float64
 2   Grade   9 non-null      category
dtypes: category(1), float64(1), object(1)
memory usage: 649.0+ bytes

In [73]:
df.info() #After type casting

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    9 non-null      object
 1   Age     9 non-null      float64
 2   Grade   9 non-null      category
dtypes: category(1), float64(1), object(1)
memory usage: 649.0+ bytes

In [74]:
df.describe() #usually use to check the info about the data set

             Age
count   9.000000
mean   30.333333
std    17.356555
min    11.000000
25%    21.000000
50%    24.000000
75%    45.000000
max    56.000000

In [75]:
df.sort_index(ascending=False)

#df.sort_index(ascending=True)

     Name   Age Grade
8   Jawad  56.0    A-
7   Arham  14.0     A
6    Saad  22.0    B-
5  Warris  21.0    C+
4    Raza  45.0    C-
3   Hamza  11.0    D+
2  Shayan  24.0     F
1     Ali  56.0    B-
0  Faizan  24.0    A+

In [76]:
df.sort_values(by='Age')

     Name   Age Grade
3   Hamza  11.0    D+
7   Arham  14.0     A
5  Warris  21.0    C+
6    Saad  22.0    B-
0  Faizan  24.0    A+
2  Shayan  24.0     F
4    Raza  45.0    C-
1     Ali  56.0    B-
8   Jawad  56.0    A-

In [77]:
df.sort_values(by='Grade')

     Name   Age Grade
7   Arham  14.0     A
0  Faizan  24.0    A+
8   Jawad  56.0    A-
1     Ali  56.0    B-
6    Saad  22.0    B-
5  Warris  21.0    C+
4    Raza  45.0    C-
3   Hamza  11.0    D+
2  Shayan  24.0     F

## Data Frames Attributes

In [78]:
df.shape

(9, 3)

In [79]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [53]:
df.columns()

TypeError: 'Index' object is not callable

The error TypeError: 'Index' object is not callable typically occurs when you try to call a DataFrame's columns attribute as a function, which is not correct. The columns attribute is used to access the column labels of the DataFrame, not to call it as a function.

In [80]:
df.columns

Index(['Name', 'Age', 'Grade'], dtype='object')

In [81]:
df.T #Tanspose the data frames

            0     1       2      3     4       5     6      7      8
Name   Faizan   Ali  Shayan  Hamza  Raza  Warris  Saad  Arham  Jawad
Age      24.0  56.0    24.0   11.0  45.0    21.0  22.0   14.0   56.0
Grade      A+    B-       F     D+    C-      C+    B-      A     A-